import pygame

pygame.init()


class Sun():
    """
    Устанавливает параметры Солнца и рисует его
    """
    pass


class Planet():
    """
    Управляет движением планет, устанавливает их параметры и рисует их
    """
    def __init__(self, number):
        """
        Рассчитывает скорость планет, их координаты и ускорения
        Параметр number выбирает планету из файла
        """
        pass
    pass



class StartButton():
   """
   Рисует стартовую кнопку, проверяет, нажата ли она и начинает симуляцию
   """
   pass


class PauseButton():
   """
   Рисует кнопку паузы, проверяет, нажата ли она и останавливает симуляцию
   """
   pass


class ResetButton():
   """
   Рисует кнопку перезагрузки, проверяет, нажата ли она и перезапускает симуляцию
   """
   pass


class Processing():
    """
    Обрабатка
    """
    pass